Model: 1
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 batch_normalization (BatchN  (None, 5, 10, 10, 24)    96        
 ormalization)                                                   
                                                                 
 conv3d (Conv3D)             (None, 5, 10, 10, 16)     10384     
                                                                 
 conv3d_1 (Conv3D)           (None, 5, 10, 10, 32)     4128      
                                                                 
 global_average_pooling3d (G  (None, 32)               0         
 lobalAveragePooling3D)                                          
                                                                 
 quantum_enhanced_layer (Qua  (None, 64)               4160      
 ntumEnhancedLayer)                                              
                                                                 
 dropout (Dropout)           (None, 64)                0         
                                                                 
 quantum_enhanced_layer_1 (Q  (None, 32)               4128      
 uantumEnhancedLayer)                                            
                                                                 
 batch_normalization_1 (Batc  (None, 32)               128       
 hNormalization)                                                 
                                                                 
 dense (Dense)               (None, 1600)              52800     
                                                                 
 reshape (Reshape)           (None, 10, 10, 16)        0         
                                                                 
 conv2d (Conv2D)             (None, 10, 10, 32)        4640      
                                                                 
 conv2d_1 (Conv2D)           (None, 10, 10, 16)        4624      
                                                                 
 conv2d_2 (Conv2D)           (None, 10, 10, 8)         1160      
                                                                 
 conv2d_3 (Conv2D)           (None, 10, 10, 1)         73        
                                                                 
=================================================================
Total params: 86,321
Trainable params: 86,209
Non-trainable params: 112
_________________________________________________________________

Model: 2
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 5, 10, 10,   0           []                               
                                24)]                                                              
                                                                                                  
 batch_normalization (BatchNorm  (None, 5, 10, 10, 2  96         ['input_1[0][0]']                
 alization)                     4)                                                                
                                                                                                  
 time_distributed (TimeDistribu  (None, 5, 10, 10, 3  6944       ['batch_normalization[0][0]']    
 ted)                           2)                                                                
                                                                                                  
 time_distributed_1 (TimeDistri  (None, 5, 10, 10, 6  18496      ['time_distributed[0][0]']       
 buted)                         4)                                                                
                                                                                                  
 reshape (Reshape)              (None, 5, 100, 24)   0           ['batch_normalization[0][0]']    
                                                                                                  
 time_distributed_2 (TimeDistri  (None, 5, 5, 5, 64)  0          ['time_distributed_1[0][0]']     
 buted)                                                                                           
                                                                                                  
 permute (Permute)              (None, 100, 5, 24)   0           ['reshape[0][0]']                
                                                                                                  
 global_average_pooling3d (Glob  (None, 64)          0           ['time_distributed_2[0][0]']     
 alAveragePooling3D)                                                                              
                                                                                                  
 reshape_1 (Reshape)            (None, 100, 120)     0           ['permute[0][0]']                
                                                                                                  
 advanced_quantum_layer (Advanc  (None, 256)         98560       ['global_average_pooling3d[0][0]'
 edQuantumLayer)                                                 ]                                
                                                                                                  
 temporal_attention (TemporalAt  (None, 100, 64)     23232       ['reshape_1[0][0]']              
 tention)                                                                                         
                                                                                                  
 dropout_1 (Dropout)            (None, 256)          0           ['advanced_quantum_layer[0][0]'] 
                                                                                                  
 dense (Dense)                  (None, 100, 128)     8320        ['temporal_attention[0][0]']     
                                                                                                  
 advanced_quantum_layer_1 (Adva  (None, 128)         65664       ['dropout_1[0][0]']              
 ncedQuantumLayer)                                                                                
                                                                                                  
 dropout (Dropout)              (None, 100, 128)     0           ['dense[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 6400)         825600      ['advanced_quantum_layer_1[0][0]'
                                                                 ]                                
                                                                                                  
 reshape_2 (Reshape)            (None, 10, 10, 128)  0           ['dropout[0][0]']                
                                                                                                  
 reshape_3 (Reshape)            (None, 10, 10, 64)   0           ['dense_1[0][0]']                
                                                                                                  
 concatenate (Concatenate)      (None, 10, 10, 192)  0           ['reshape_2[0][0]',              
                                                                  'reshape_3[0][0]']              
                                                                                                  
 spatial_attention (SpatialAtte  (None, 10, 10, 192)  193        ['concatenate[0][0]']            
 ntion)                                                                                           
                                                                                                  
 conv2d_2 (Conv2D)              (None, 10, 10, 128)  221312      ['spatial_attention[0][0]']      
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 10, 10, 128)  512        ['conv2d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 conv2d_3 (Conv2D)              (None, 10, 10, 64)   73792       ['batch_normalization_1[0][0]']  
                                                                                                  
 dropout_2 (Dropout)            (None, 10, 10, 64)   0           ['conv2d_3[0][0]']               
                                                                                                  
 conv2d_4 (Conv2D)              (None, 10, 10, 32)   18464       ['dropout_2[0][0]']              
                                                                                                  
 conv2d_5 (Conv2D)              (None, 10, 10, 16)   4624        ['conv2d_4[0][0]']               
                                                                                                  
 conv2d_6 (Conv2D)              (None, 10, 10, 1)    145         ['conv2d_5[0][0]']               
                                                                                                  
==================================================================================================
Total params: 1,365,954
Trainable params: 1,365,650
Non-trainable params: 304
__________________________________________________________________________________________________

Model: 3
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_2 (InputLayer)           [(None, 5, 10, 10,   0           []                               
                                24)]                                                              
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 5, 10, 10, 2  96         ['input_2[0][0]']                
 rmalization)                   4)                                                                
                                                                                                  
 time_distributed_3 (TimeDistri  (None, 5, 10, 10, 3  6944       ['batch_normalization_1[0][0]']  
 buted)                         2)                                                                
                                                                                                  
 time_distributed_4 (TimeDistri  (None, 5, 10, 10, 6  18496      ['time_distributed_3[0][0]']     
 buted)                         4)                                                                
                                                                                                  
 reshape_2 (Reshape)            (None, 5, 100, 24)   0           ['batch_normalization_1[0][0]']  
                                                                                                  
 time_distributed_5 (TimeDistri  (None, 5, 5, 5, 64)  0          ['time_distributed_4[0][0]']     
 buted)                                                                                           
                                                                                                  
 permute_1 (Permute)            (None, 100, 5, 24)   0           ['reshape_2[0][0]']              
                                                                                                  
 global_average_pooling3d (Glob  (None, 64)          0           ['time_distributed_5[0][0]']     
 alAveragePooling3D)                                                                              
                                                                                                  
 reshape_3 (Reshape)            (None, 100, 120)     0           ['permute_1[0][0]']              
                                                                                                  
 advanced_quantum_layer (Advanc  (None, 256)         98560       ['global_average_pooling3d[0][0]'
 edQuantumLayer)                                                 ]                                
                                                                                                  
 temporal_attention (TemporalAt  (None, 100, 64)     23232       ['reshape_3[0][0]']              
 tention)                                                                                         
                                                                                                  
 dropout_3 (Dropout)            (None, 256)          0           ['advanced_quantum_layer[0][0]'] 
                                                                                                  
 dense (Dense)                  (None, 100, 128)     8320        ['temporal_attention[0][0]']     
                                                                                                  
 advanced_quantum_layer_1 (Adva  (None, 128)         65664       ['dropout_3[0][0]']              
 ncedQuantumLayer)                                                                                
                                                                                                  
 dropout_2 (Dropout)            (None, 100, 128)     0           ['dense[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 6400)         825600      ['advanced_quantum_layer_1[0][0]'
                                                                 ]                                
                                                                                                  
 reshape_4 (Reshape)            (None, 10, 10, 128)  0           ['dropout_2[0][0]']              
                                                                                                  
 reshape_5 (Reshape)            (None, 10, 10, 64)   0           ['dense_1[0][0]']                
                                                                                                  
 concatenate (Concatenate)      (None, 10, 10, 192)  0           ['reshape_4[0][0]',              
                                                                  'reshape_5[0][0]']              
                                                                                                  
 spatial_attention (SpatialAtte  (None, 10, 10, 192)  193        ['concatenate[0][0]']            
 ntion)                                                                                           
                                                                                                  
 separable_conv2d (SeparableCon  (None, 10, 10, 128)  26432      ['spatial_attention[0][0]']      
 v2D)                                                                                             
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 10, 10, 128)  512        ['separable_conv2d[0][0]']       
 rmalization)                                                                                     
                                                                                                  
 conv2d_4 (Conv2D)              (None, 10, 10, 128)  24704       ['spatial_attention[0][0]']      
                                                                                                  
 add (Add)                      (None, 10, 10, 128)  0           ['batch_normalization_2[0][0]',  
                                                                  'conv2d_4[0][0]']               
                                                                                                  
 activation (Activation)        (None, 10, 10, 128)  0           ['add[0][0]']                    
                                                                                                  
 conv2d_5 (Conv2D)              (None, 10, 10, 96)   110688      ['activation[0][0]']             
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 10, 10, 96)  384         ['conv2d_5[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 dropout_4 (Dropout)            (None, 10, 10, 96)   0           ['batch_normalization_3[0][0]']  
                                                                                                  
 depthwise_conv2d (DepthwiseCon  (None, 10, 10, 96)  960         ['dropout_4[0][0]']              
 v2D)                                                                                             
                                                                                                  
 conv2d_6 (Conv2D)              (None, 10, 10, 64)   6208        ['depthwise_conv2d[0][0]']       
                                                                                                  
 conv2d_7 (Conv2D)              (None, 10, 10, 48)   27696       ['conv2d_6[0][0]']               
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 10, 10, 48)  192         ['conv2d_7[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 conv2d_8 (Conv2D)              (None, 10, 10, 32)   13856       ['batch_normalization_4[0][0]']  
                                                                                                  
 dropout_5 (Dropout)            (None, 10, 10, 32)   0           ['conv2d_8[0][0]']               
                                                                                                  
 conv2d_9 (Conv2D)              (None, 10, 10, 1)    289         ['dropout_5[0][0]']              
                                                                                                  
==================================================================================================
Total params: 1,259,026
Trainable params: 1,258,434
Non-trainable params: 592
__________________________________________________________________________________________________
